network-tests/v1/oha-results/non-colorized/linkerd/pod/bookinfo-ha/test-pod-172.20.15.138-16-500.txt
Started at 2024-03-21-16-09
Summary:
  Success rate:	100.00%
  Total:	180.0011 secs
  Slowest:	122.4232 secs
  Fastest:	0.0923 secs
  Average:	61.1630 secs
  Requests/sec:	160.0101

  Total data:	130.45 MiB
  Size/request:	4.
  Size/sec:	742.12 KiB

Response time histogram:
    0.092 [1]    |
   12.325 [2834] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
   24.559 [2907] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
   36.792 [2914] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
   49.025 [2915] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
   61.258 [2855] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
   73.491 [2880] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
   85.724 [2886] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
   97.957 [2866] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  110.190 [2923] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  122.423 [2805] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

Response time distribution:
  10.00% in 12.5010 secs
  25.00% in 30.5485 secs
  50.00% in 61.1222 secs
  75.00% in 91.3818 secs
  90.00% in 109.9050 secs
  95.00% in 116.2570 secs
  99.00% in 121.2306 secs
  99.90% in 122.3292 secs
  99.99% in 122.4152 secs


Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0040 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200] 28786 responses

Error distribution:
  [16] aborted due to deadline
Finished at 2024-03-21-16-12